20200525_declarative_domain_logic_tada.org
#+TITLE: Declarative Domain Logic, Data-Driven Events, and the Tada library

https://www.youtube.com/watch?v=TFQlpBEpeks

* The problem of /Fat Handlers/
A WebApp is mostly front for a database (we care about managing data).

The design is some variation on this:

=client <-> app.handler <-> app.db <-> db=

Our handler supports routes, usually with a ~ 1:1 mapping with db operation

#+begin_src clojure
  (PUT "/events/:event-if/book-ticket"
       [user-id event-id]
       ;; business logic here - check the stuff we're being sent, validate
       (db/book-ticket! user-id event-id))
#+end_src

The 'business logic' in here gets big! Messy! Lots of branching! Very error prone and complected. It's entangled with HTTP. How do you test it? You have to mock HTTP calls (or stand up a web-server).

This is the /Fat Handler/ pattern, and it's not great. we want separation of concerns.

We can use middleware/interceptors, which might be OK for generic things (e.g. type coercion). But we also need a lot a domain specific stuff.

We can put an =app.events= layer which separates the business logic from the handler implementation, which helps. But if we want a feature we now just have to create new 'thing' in every layer. And the events (as functions) are mostly doing the same stuff: checking input validity, state validity, and id everything is fine, processing an effect. It's still big, messy, complected. Mostly we're just moving the problem

The Clojure approach: make the event data.

#+begin_src clojure
  [{:id :book-ticket!

    :params {:event-id uuid?
             :user-id  uuid?}

    :conditions (fn [{:keys [event-id user-id]}]
                  (let [event (db/get-event event-id)]
                    [[(db/user-exists? user-id)
                      :forbidden "No user with that id"]
                     [(db/event-exists? event-id)
                      :incorrect "No event with that id"]
                     [(<= (event :capacity) (event :tickets-sold))
                      :unsupported "Event at capacity"]]))

    :effect (fn [{:keys [event-id user-id]}]
              (-> (db/book-ticket! user-id event-id)
                  email/send-ticket-confirmation!))}]
#+end_src

Then send it to a dispatch! function which checks the conditions and performs the side effect.

What do we get? Separation of concerns (conditions clearly separated from effect etc.)

All you can do with a function is call it - data is much more /transparent/ and fungible.

With data, you can 'remix' the pieces, as you like - e.g. /make/ a macro that creates a function from it (to get you back to where you were). Or generate Docs from it. Generate an rpc interface.

Did we just create objects? Yes, honestly. But we're only using them in a specific place, and they're not mutable state. And they're just data, there's no object baggage. So /good/ objects :)

* The Tada library
Basically an implementation of the above.

You =register= events, then dispatch them with =do!= (kinda like react but on the backend)

More interesting things (not implemented as of 9/30/19): 
+ Derive Ring handler. 
+ Deploy it to aws Lambda
+ Check 'hypothetical' event with =can?= - would you be allowed to do this if you wanted (i.e. conditions met)

* Implications of a Data-Driven approach
We tend to end up in a 'declarative' space for any problem after a while.

One potential direction is a web-app framework of declarative components (libraries) for solving particular problems, which ar configured with data.

An alternative: the data is the /domain model/, the business logic. Instead, we work out how to get domain model into the libraries. =Hodor= is a lib for describing entities (types). But entities/relationships (and events) are not the whole domain model. It's missing:
+ data-views (queries, subscriptions)
+ cross-cutting constraints
+ permissions (read and write)

We can get these from /different/ libraries. But they are /connected/ and often together.

This is the long term vision for /Tada/

* Tada annotated Library
