20200525_declarative_domain_logic_tada.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-25 Mon 14:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Declarative Domain Logic, Data-Driven Events, and the Tada library</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Joe" />
</head>
<body>
<div id="content">
<h1 class="title">Declarative Domain Logic, Data-Driven Events, and the Tada library</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org02883fa">1. The problem of <i>Fat Handlers</i></a></li>
<li><a href="#orgae68bb6">2. The Tada library</a></li>
<li><a href="#orga939313">3. Implications of a Data-Driven approach</a></li>
<li><a href="#orgb5749ca">4. Tada annotated Library</a>
<ul>
<li><a href="#orgced7285">4.1. Intro, deps and state</a></li>
<li><a href="#orgdaf9ebe">4.2. Terms</a></li>
<li><a href="#org0c8ccb5">4.3. Flow</a></li>
<li><a href="#orge377e8e">4.4. Specs</a>
<ul>
<li><a href="#org314715e">4.4.1. Condition Function</a></li>
<li><a href="#org95672f4">4.4.2. Event</a></li>
</ul>
</li>
<li><a href="#orgb6b4300">4.5. register</a></li>
<li><a href="#org7dbd317">4.6. do! helpers</a>
<ul>
<li><a href="#orge4dc91e">4.6.1. transformer - stripping extra stuff out of an event</a></li>
<li><a href="#orgad4aabf">4.6.2. sanitize-params - returns nil if spec not passed</a></li>
<li><a href="#org2135ffe">4.6.3. rule-errors - calls event conditions, returns true if passed</a></li>
<li><a href="#org4555231">4.6.4. explain-params-errors -</a></li>
</ul>
</li>
<li><a href="#orgb1105ce">4.7. do! - main dispatch function.</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<a href="https://www.youtube.com/watch?v=TFQlpBEpeks">https://www.youtube.com/watch?v=TFQlpBEpeks</a>
</p>

<div id="outline-container-org02883fa" class="outline-2">
<h2 id="org02883fa"><span class="section-number-2">1</span> The problem of <i>Fat Handlers</i></h2>
<div class="outline-text-2" id="text-1">
<p>
A WebApp is mostly front for a database (we care about managing data).
</p>

<p>
The design is some variation on this:
</p>

<p>
<code>client &lt;-&gt; app.handler &lt;-&gt; app.db &lt;-&gt; db</code>
</p>

<p>
Our handler supports routes, usually with a ~ 1:1 mapping with db operation
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #458588;">(</span>PUT <span style="color: #b8bb26;">"/events/:event-if/book-ticket"</span>
     <span style="color: #b16286;">[</span>user-id event-id<span style="color: #b16286;">]</span>
     <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">business logic here - check the stuff we're being sent, validate</span>
     <span style="color: #b16286;">(</span><span style="color: #d3869b;">db</span>/book-ticket! user-id event-id<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>

<p>
The 'business logic' in here gets big! Messy! Lots of branching! Very error prone and complected. It's entangled with HTTP. How do you test it? You have to mock HTTP calls (or stand up a web-server).
</p>

<p>
This is the <i>Fat Handler</i> pattern, and it's not great. we want separation of concerns.
</p>

<p>
We can use middleware/interceptors, which might be OK for generic things (e.g. type coercion). But we also need a lot a domain specific stuff.
</p>

<p>
We can put an <code>app.events</code> layer which separates the business logic from the handler implementation, which helps. But if we want a feature we now just have to create new 'thing' in every layer. And the events (as functions) are mostly doing the same stuff: checking input validity, state validity, and id everything is fine, processing an effect. It's still big, messy, complected. Mostly we're just moving the problem
</p>

<p>
The Clojure approach: make the event data.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #458588;">[</span><span style="color: #b16286;">{</span><span style="color: #d3869b;">:id</span> <span style="color: #d3869b;">:book-ticket!</span>

  <span style="color: #d3869b;">:params</span> <span style="color: #8ec07c;">{</span><span style="color: #d3869b;">:event-id</span> uuid?
           <span style="color: #d3869b;">:user-id</span>  uuid?<span style="color: #8ec07c;">}</span>

  <span style="color: #d3869b;">:conditions</span> <span style="color: #8ec07c;">(</span><span style="color: #fb4933;">fn</span> <span style="color: #d65d0e;">[</span><span style="color: #458588;">{</span><span style="color: #d3869b;">:keys</span> <span style="color: #b16286;">[</span>event-id user-id<span style="color: #b16286;">]</span><span style="color: #458588;">}</span><span style="color: #d65d0e;">]</span>
                <span style="color: #d65d0e;">(</span><span style="color: #fb4933;">let</span> <span style="color: #458588;">[</span>event <span style="color: #b16286;">(</span><span style="color: #d3869b;">db</span>/get-event event-id<span style="color: #b16286;">)</span><span style="color: #458588;">]</span>
                  <span style="color: #458588;">[</span><span style="color: #b16286;">[</span><span style="color: #8ec07c;">(</span><span style="color: #d3869b;">db</span>/user-exists? user-id<span style="color: #8ec07c;">)</span>
                    <span style="color: #d3869b;">:forbidden</span> <span style="color: #b8bb26;">"No user with that id"</span><span style="color: #b16286;">]</span>
                   <span style="color: #b16286;">[</span><span style="color: #8ec07c;">(</span><span style="color: #d3869b;">db</span>/event-exists? event-id<span style="color: #8ec07c;">)</span>
                    <span style="color: #d3869b;">:incorrect</span> <span style="color: #b8bb26;">"No event with that id"</span><span style="color: #b16286;">]</span>
                   <span style="color: #b16286;">[</span><span style="color: #8ec07c;">(</span>&lt;= <span style="color: #d65d0e;">(</span>event <span style="color: #d3869b;">:capacity</span><span style="color: #d65d0e;">)</span> <span style="color: #d65d0e;">(</span>event <span style="color: #d3869b;">:tickets-sold</span><span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span>
                    <span style="color: #d3869b;">:unsupported</span> <span style="color: #b8bb26;">"Event at capacity"</span><span style="color: #b16286;">]</span><span style="color: #458588;">]</span><span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span>

  <span style="color: #d3869b;">:effect</span> <span style="color: #8ec07c;">(</span><span style="color: #fb4933;">fn</span> <span style="color: #d65d0e;">[</span><span style="color: #458588;">{</span><span style="color: #d3869b;">:keys</span> <span style="color: #b16286;">[</span>event-id user-id<span style="color: #b16286;">]</span><span style="color: #458588;">}</span><span style="color: #d65d0e;">]</span>
            <span style="color: #d65d0e;">(</span><span style="color: #fb4933;">-&gt;</span> <span style="color: #458588;">(</span><span style="color: #d3869b;">db</span>/book-ticket! user-id event-id<span style="color: #458588;">)</span>
                <span style="color: #d3869b;">email</span>/send-ticket-confirmation!<span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">}</span><span style="color: #458588;">]</span>
</pre>
</div>

<p>
Then send it to a dispatch! function which checks the conditions and performs the side effect.
</p>

<p>
What do we get? Separation of concerns (conditions clearly separated from effect etc.)
</p>

<p>
All you can do with a function is call it - data is much more <i>transparent</i> and fungible.
</p>

<p>
With data, you can 'remix' the pieces, as you like - e.g. <i>make</i> a macro that creates a function from it (to get you back to where you were). Or generate Docs from it. Generate an rpc interface.
</p>

<p>
Did we just create objects? Yes, honestly. But we're only using them in a specific place, and they're not mutable state. And they're just data, there's no object baggage. So <i>good</i> objects :)
</p>
</div>
</div>

<div id="outline-container-orgae68bb6" class="outline-2">
<h2 id="orgae68bb6"><span class="section-number-2">2</span> The Tada library</h2>
<div class="outline-text-2" id="text-2">
<p>
Basically an implementation of the above.
</p>

<p>
You <code>register</code> events, then dispatch them with <code>do!</code> (kinda like react but on the backend)
</p>

<p>
More interesting things (not implemented as of 9/30/19): 
</p>
<ul class="org-ul">
<li>Derive Ring handler.</li>
<li>Deploy it to aws Lambda</li>
<li>Check 'hypothetical' event with <code>can?</code> - would you be allowed to do this if you wanted (i.e. conditions met)</li>
</ul>
</div>
</div>

<div id="outline-container-orga939313" class="outline-2">
<h2 id="orga939313"><span class="section-number-2">3</span> Implications of a Data-Driven approach</h2>
<div class="outline-text-2" id="text-3">
<p>
We tend to end up in a 'declarative' space for any problem after a while.
</p>

<p>
One potential direction is a web-app framework of declarative components (libraries) for solving particular problems, which ar configured with data.
</p>

<p>
An alternative: the data is the <i>domain model</i>, the business logic. Instead, we work out how to get domain model into the libraries. <code>Hodor</code> is a lib for describing entities (types). But entities/relationships (and events) are not the whole domain model. It's missing:
</p>
<ul class="org-ul">
<li>data-views (queries, subscriptions)</li>
<li>cross-cutting constraints</li>
<li>permissions (read and write)</li>
</ul>

<p>
We can get these from <i>different</i> libraries. But they are <i>connected</i> and often together.
</p>

<p>
This is the long term vision for <i>Tada</i>
</p>
</div>
</div>

<div id="outline-container-orgb5749ca" class="outline-2">
<h2 id="orgb5749ca"><span class="section-number-2">4</span> Tada annotated Library</h2>
<div class="outline-text-2" id="text-4">
</div>
