20200525_declarative_domain_logic_tada.org
** Intro, deps and state
https://github.com/rafd/tada/blob/master/src/tada/events/core.cljc

This is a wonderfully small codebase of ~100 lines

You can see from the deps that spec (and spec tools) are used heavily.

#+begin_src clojure
  (ns tada.events.core
    (:require
     [clojure.spec.alpha :as s]
     [clojure.string :as string]
     [clojure.core.match :as match]
     [spec-tools.core :as st]
     [spec-tools.data-spec :as ds]))
#+end_src

The library follows a 'registry' model, where events are registered with the =register!= function. The implementation is a simple atom.

#+begin_src clojure
  (defonce event-store (atom {}))
#+end_src

** Terms
+ *event* - something that has happened. The event has a name (id), facts about it (params) which can be valid or invalid, an implementation (effect). Events are created and *registered*.
+ *condition* - an invariant which must be checked before an event can be processed through its effect. For example before a 'ticket-booked' event can be processed, the 'has available capacity' condition must be met.
+ *effect* - the implementation of an event, how it effects the world. A 'ticket-booked' event might send an email to the booker, and will record the event in a database.
+ *anomaly*
+ *event-store* - where registered events are stored

** Flow
+ User creates /events/.
+ User /registers/ the events.
+ User /dispatches/ events (with passed args). The args are parsed and checked according to the event params and the conditions, and if everything looks good the 'effect' happens
** Specs
*** Condition Function
The spec for =condition-fn= is not actually used, but included for illustrative purposes. So lets check it out

A /condition-function/ (a function which is used in a condition?), it pretty simple: it takes a map, and returns a collections of maps which have =:status=, =:anomaly= and =:message= 

#+begin_src clojure
  (s/def :tada/condition-fn
    (ds/spec
      {:name :tada/condition-fn
       :spec (s/fspec
               :args (s/cat :arg map?)
               :ret (s/coll-of
                      (s/cat
                        :status boolean?
                        :anomaly keyword?
                        :message string?)))}))
#+end_src

*** Event
An event is a map that has has =:params= and =:conditions= (condition functions), and optionally =:effect= and =:return=.

#+begin_src clojure
  (s/def :tada/event
    (ds/spec
      {:name :tada/event
       :spec {:params          {keyword? (ds/or {:keyword keyword?
                                                 :fn      fn?
                                                 :spec    s/spec?})}
              :conditions      fn? ;; :tada/condition-fn
              (ds/opt :effect) fn?
              (ds/opt :return) fn?}}))

  (s/def :tada/events
    (ds/spec
      {:name :tada/events
       :spec {keyword? :tada/event}}))

  (defn- make-event-spec
    [event]
    (ds/spec {:name (keyword "ev-spec" (name (event :id)))
              :spec (event :params)}))
#+end_src

