20200525_declarative_domain_logic_tada.html
<div id="outline-container-orgced7285" class="outline-3">
<h3 id="orgced7285"><span class="section-number-3">4.1</span> Intro, deps and state</h3>
<div class="outline-text-3" id="text-4-1">
<p>
<a href="https://github.com/rafd/tada/blob/master/src/tada/events/core.cljc">https://github.com/rafd/tada/blob/master/src/tada/events/core.cljc</a>
</p>

<p>
This is a wonderfully small codebase of ~100 lines
</p>

<p>
You can see from the deps that spec (and spec tools) are used heavily.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #458588;">(</span><span style="color: #fb4933;">ns</span> <span style="color: #d3869b;">tada.events.core</span>
  <span style="color: #b16286;">(</span><span style="color: #d3869b;">:require</span>
   <span style="color: #8ec07c;">[</span>clojure.spec.alpha <span style="color: #d3869b;">:as</span> s<span style="color: #8ec07c;">]</span>
   <span style="color: #8ec07c;">[</span>clojure.string <span style="color: #d3869b;">:as</span> string<span style="color: #8ec07c;">]</span>
   <span style="color: #8ec07c;">[</span>clojure.core.match <span style="color: #d3869b;">:as</span> match<span style="color: #8ec07c;">]</span>
   <span style="color: #8ec07c;">[</span>spec-tools.core <span style="color: #d3869b;">:as</span> st<span style="color: #8ec07c;">]</span>
   <span style="color: #8ec07c;">[</span>spec-tools.data-spec <span style="color: #d3869b;">:as</span> ds<span style="color: #8ec07c;">]</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>

<p>
The library follows a 'registry' model, where events are registered with the <code>register!</code> function. The implementation is a simple atom.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #458588;">(</span><span style="color: #fb4933;">defonce</span> <span style="color: #83a598;">event-store</span> <span style="color: #b16286;">(</span>atom <span style="color: #8ec07c;">{}</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdaf9ebe" class="outline-3">
<h3 id="orgdaf9ebe"><span class="section-number-3">4.2</span> Terms</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li><b>event</b> - something that has happened. The event has a name (id), facts about it (params) which can be valid or invalid, an implementation (effect). Events are created and <b>registered</b>.</li>
<li><b>condition</b> - an invariant which must be checked before an event can be processed through its effect. For example before a 'ticket-booked' event can be processed, the 'has available capacity' condition must be met.</li>
<li><b>effect</b> - the implementation of an event, how it effects the world. A 'ticket-booked' event might send an email to the booker, and will record the event in a database.</li>
<li><b>anomaly</b></li>
<li><b>event-store</b> - where registered events are stored</li>
</ul>
</div>
</div>

<div id="outline-container-org0c8ccb5" class="outline-3">
<h3 id="org0c8ccb5"><span class="section-number-3">4.3</span> Flow</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>User creates <i>events</i>.</li>
<li>User <i>registers</i> the events.</li>
<li>User <i>dispatches</i> events (with passed args). The args are parsed and checked according to the event params and the conditions, and if everything looks good the 'effect' happens</li>
</ul>
</div>
</div>
<div id="outline-container-orge377e8e" class="outline-3">
<h3 id="orge377e8e"><span class="section-number-3">4.4</span> Specs</h3>
<div class="outline-text-3" id="text-4-4">
</div>
<div id="outline-container-org314715e" class="outline-4">
<h4 id="org314715e"><span class="section-number-4">4.4.1</span> Condition Function</h4>
<div class="outline-text-4" id="text-4-4-1">
<p>
The spec for <code>condition-fn</code> is not actually used, but included for illustrative purposes. So lets check it out
</p>

<p>
A <i>condition-function</i> (a function which is used in a condition?), it pretty simple: it takes a map, and returns a collections of maps which have <code>:status</code>, <code>:anomaly</code> and <code>:message</code> 
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #458588;">(</span><span style="color: #d3869b;">s</span>/<span style="color: #fb4933;">def</span> <span style="color: #d3869b;">:</span><span style="color: #d3869b;">tada</span><span style="color: #fdf4c1; background-color: #282828;">/</span><span style="color: #d3869b;">condition-fn</span>
  <span style="color: #b16286;">(</span><span style="color: #d3869b;">ds</span>/spec
    <span style="color: #8ec07c;">{</span><span style="color: #d3869b;">:name</span> <span style="color: #d3869b;">:</span><span style="color: #d3869b;">tada</span><span style="color: #fdf4c1; background-color: #282828;">/</span><span style="color: #d3869b;">condition-fn</span>
     <span style="color: #d3869b;">:spec</span> <span style="color: #d65d0e;">(</span><span style="color: #d3869b;">s</span>/fspec
             <span style="color: #d3869b;">:args</span> <span style="color: #458588;">(</span><span style="color: #d3869b;">s</span>/cat <span style="color: #d3869b;">:arg</span> map?<span style="color: #458588;">)</span>
             <span style="color: #d3869b;">:ret</span> <span style="color: #458588;">(</span><span style="color: #d3869b;">s</span>/coll-of
                    <span style="color: #b16286;">(</span><span style="color: #d3869b;">s</span>/cat
                      <span style="color: #d3869b;">:status</span> boolean?
                      <span style="color: #d3869b;">:anomaly</span> keyword?
                      <span style="color: #d3869b;">:message</span> string?<span style="color: #b16286;">)</span><span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">}</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org95672f4" class="outline-4">
<h4 id="org95672f4"><span class="section-number-4">4.4.2</span> Event</h4>
<div class="outline-text-4" id="text-4-4-2">
<p>
An event is a map that has has <code>:params</code> and <code>:conditions</code> (condition functions), and optionally <code>:effect</code> and <code>:return</code>.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #458588;">(</span><span style="color: #d3869b;">s</span>/<span style="color: #fb4933;">def</span> <span style="color: #d3869b;">:</span><span style="color: #d3869b;">tada</span><span style="color: #fdf4c1; background-color: #282828;">/</span><span style="color: #d3869b;">event</span>
  <span style="color: #b16286;">(</span><span style="color: #d3869b;">ds</span>/spec
    <span style="color: #8ec07c;">{</span><span style="color: #d3869b;">:name</span> <span style="color: #d3869b;">:</span><span style="color: #d3869b;">tada</span><span style="color: #fdf4c1; background-color: #282828;">/</span><span style="color: #d3869b;">event</span>
     <span style="color: #d3869b;">:spec</span> <span style="color: #d65d0e;">{</span><span style="color: #d3869b;">:params</span>          <span style="color: #458588;">{</span>keyword? <span style="color: #b16286;">(</span><span style="color: #d3869b;">ds</span>/or <span style="color: #8ec07c;">{</span><span style="color: #d3869b;">:keyword</span> keyword?
                                               <span style="color: #d3869b;">:fn</span>      fn?
                                               <span style="color: #d3869b;">:spec</span>    <span style="color: #d3869b;">s</span>/spec?<span style="color: #8ec07c;">}</span><span style="color: #b16286;">)</span><span style="color: #458588;">}</span>
            <span style="color: #d3869b;">:conditions</span>      fn? <span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">:tada/condition-fn</span>
            <span style="color: #458588;">(</span><span style="color: #d3869b;">ds</span>/opt <span style="color: #d3869b;">:effect</span><span style="color: #458588;">)</span> fn?
            <span style="color: #458588;">(</span><span style="color: #d3869b;">ds</span>/opt <span style="color: #d3869b;">:return</span><span style="color: #458588;">)</span> fn?<span style="color: #d65d0e;">}</span><span style="color: #8ec07c;">}</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #458588;">(</span><span style="color: #d3869b;">s</span>/<span style="color: #fb4933;">def</span> <span style="color: #d3869b;">:</span><span style="color: #d3869b;">tada</span><span style="color: #fdf4c1; background-color: #282828;">/</span><span style="color: #d3869b;">events</span>
  <span style="color: #b16286;">(</span><span style="color: #d3869b;">ds</span>/spec
    <span style="color: #8ec07c;">{</span><span style="color: #d3869b;">:name</span> <span style="color: #d3869b;">:</span><span style="color: #d3869b;">tada</span><span style="color: #fdf4c1; background-color: #282828;">/</span><span style="color: #d3869b;">events</span>
     <span style="color: #d3869b;">:spec</span> <span style="color: #d65d0e;">{</span>keyword? <span style="color: #d3869b;">:</span><span style="color: #d3869b;">tada</span><span style="color: #fdf4c1; background-color: #282828;">/</span><span style="color: #d3869b;">event</span><span style="color: #d65d0e;">}</span><span style="color: #8ec07c;">}</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #458588;">(</span><span style="color: #fb4933;">defn-</span> <span style="color: #fabd2f;">make-event-spec</span>
  <span style="color: #b16286;">[</span>event<span style="color: #b16286;">]</span>
  <span style="color: #b16286;">(</span><span style="color: #d3869b;">ds</span>/spec <span style="color: #8ec07c;">{</span><span style="color: #d3869b;">:name</span> <span style="color: #d65d0e;">(</span>keyword <span style="color: #b8bb26;">"ev-spec"</span> <span style="color: #458588;">(</span>name <span style="color: #b16286;">(</span>event <span style="color: #d3869b;">:id</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span>
            <span style="color: #d3869b;">:spec</span> <span style="color: #d65d0e;">(</span>event <span style="color: #d3869b;">:params</span><span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">}</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>
</div>
