20200525_declarative_domain_logic_tada.org
** register
Register is passed an event(s) (which is spec-checked), and if it's valid, registers it in the event-store.

#+begin_src clojure
  (defn register!
    [events]
    {:pre  [(every? (partial s/valid? :tada/event) events)]
     :post [(s/valid? :tada/events @event-store)]}
    (swap! event-store merge
           (->> events
                (map (fn [event]
                       [(event :id)
                        (assoc event :params-spec
                               (make-event-spec event))]))
                (into {}))))

#+end_src

On the way in, it transforms each event into a kv pair of the event-id and the event, and also adds the spec of the event as a =:params-spec=.

#+begin_src clojure
  ;; in
  [{:id         my-event
    :params     {:some :map}
    :conditions cond-fn
    :effect     fn1
    :return     fn2}]

  ;; out
  {:my-event {:id          my-event
              :params      {:some :map}
              :params-spec ds-spec
              :conditions  cond-fn
              :effect      fn1
              :return      fn2}}
#+end_src

** do! helpers
A few helpers for =do!=
*** transformer - stripping extra stuff out of an event
Just a gloss on top of spec-tools transformer, stripping out extra stuff

#+begin_src clojure
  (def transformer
    (st/type-transformer
      st/string-transformer
      st/strip-extra-keys-transformer
      st/strip-extra-values-transformer))
#+end_src

*** sanitize-params - returns nil if spec not passed
#+begin_src clojure
  (defn- sanitize-params
    "Given a params-spec and params,
     if the params pass the spec, returns the params
       (eliding any extra keys and values)
     if params do not pass spec, returns nil"
    [event params]
    (let [coerced-params (st/coerce (event :params-spec) params transformer)]
      (when (s/valid? (event :params-spec) coerced-params)
        coerced-params)))
#+end_src

*** rule-errors - calls event conditions, returns true if passed
#+begin_src clojure
  (defn- rule-errors
    "Returns boolean of whether the the conditions for an event are satisfied.
     Should be called with sanitized-params."
    [event sanitized-params]
    (->> ((event :conditions) sanitized-params)
         (remove (fn [[pass? _ _]] pass?))
         (map (fn [[pass? anomaly message]]
                {:anomaly anomaly
                 :message message}))))
#+end_src

