20200525_declarative_domain_logic_tada.html

<div id="outline-container-orgb6b4300" class="outline-3">
<h3 id="orgb6b4300"><span class="section-number-3">4.5</span> register</h3>
<div class="outline-text-3" id="text-4-5">
<p>
Register is passed an event(s) (which is spec-checked), and if it's valid, registers it in the event-store.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #458588;">(</span><span style="color: #fb4933;">defn</span> <span style="color: #fabd2f;">register!</span>
  <span style="color: #b16286;">[</span>events<span style="color: #b16286;">]</span>
  <span style="color: #b16286;">{</span><span style="color: #d3869b;">:pre</span>  <span style="color: #8ec07c;">[</span><span style="color: #d65d0e;">(</span>every? <span style="color: #458588;">(</span>partial <span style="color: #d3869b;">s</span>/valid? <span style="color: #d3869b;">:</span><span style="color: #d3869b;">tada</span><span style="color: #fdf4c1; background-color: #282828;">/</span><span style="color: #d3869b;">event</span><span style="color: #458588;">)</span> events<span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">]</span>
   <span style="color: #d3869b;">:post</span> <span style="color: #8ec07c;">[</span><span style="color: #d65d0e;">(</span><span style="color: #d3869b;">s</span>/valid? <span style="color: #d3869b;">:</span><span style="color: #d3869b;">tada</span><span style="color: #fdf4c1; background-color: #282828;">/</span><span style="color: #d3869b;">events</span> @event-store<span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">]</span><span style="color: #b16286;">}</span>
  <span style="color: #b16286;">(</span>swap! event-store merge
         <span style="color: #8ec07c;">(</span><span style="color: #fb4933;">-&gt;&gt;</span> events
              <span style="color: #d65d0e;">(</span>map <span style="color: #458588;">(</span><span style="color: #fb4933;">fn</span> <span style="color: #b16286;">[</span>event<span style="color: #b16286;">]</span>
                     <span style="color: #b16286;">[</span><span style="color: #8ec07c;">(</span>event <span style="color: #d3869b;">:id</span><span style="color: #8ec07c;">)</span>
                      <span style="color: #8ec07c;">(</span>assoc event <span style="color: #d3869b;">:params-spec</span>
                             <span style="color: #d65d0e;">(</span>make-event-spec event<span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">]</span><span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span>
              <span style="color: #d65d0e;">(</span>into <span style="color: #458588;">{}</span><span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

</pre>
</div>

<p>
On the way in, it transforms each event into a kv pair of the event-id and the event, and also adds the spec of the event as a <code>:params-spec</code>.
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">in</span>
<span style="color: #458588;">[</span><span style="color: #b16286;">{</span><span style="color: #d3869b;">:id</span>         my-event
  <span style="color: #d3869b;">:params</span>     <span style="color: #8ec07c;">{</span><span style="color: #d3869b;">:some</span> <span style="color: #d3869b;">:map</span><span style="color: #8ec07c;">}</span>
  <span style="color: #d3869b;">:conditions</span> cond-fn
  <span style="color: #d3869b;">:effect</span>     fn1
  <span style="color: #d3869b;">:return</span>     fn2<span style="color: #b16286;">}</span><span style="color: #458588;">]</span>

<span style="color: #7c6f64;">;; </span><span style="color: #7c6f64;">out</span>
<span style="color: #458588;">{</span><span style="color: #d3869b;">:my-event</span> <span style="color: #b16286;">{</span><span style="color: #d3869b;">:id</span>          my-event
            <span style="color: #d3869b;">:params</span>      <span style="color: #8ec07c;">{</span><span style="color: #d3869b;">:some</span> <span style="color: #d3869b;">:map</span><span style="color: #8ec07c;">}</span>
            <span style="color: #d3869b;">:params-spec</span> ds-spec
            <span style="color: #d3869b;">:conditions</span>  cond-fn
            <span style="color: #d3869b;">:effect</span>      fn1
            <span style="color: #d3869b;">:return</span>      fn2<span style="color: #b16286;">}</span><span style="color: #458588;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7dbd317" class="outline-3">
<h3 id="org7dbd317"><span class="section-number-3">4.6</span> do! helpers</h3>
<div class="outline-text-3" id="text-4-6">
<p>
A few helpers for <code>do!</code>
</p>
</div>
<div id="outline-container-orge4dc91e" class="outline-4">
<h4 id="orge4dc91e"><span class="section-number-4">4.6.1</span> transformer - stripping extra stuff out of an event</h4>
<div class="outline-text-4" id="text-4-6-1">
<p>
Just a gloss on top of spec-tools transformer, stripping out extra stuff
</p>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #458588;">(</span><span style="color: #fb4933;">def</span> <span style="color: #83a598;">transformer</span>
  <span style="color: #b16286;">(</span><span style="color: #d3869b;">st</span>/type-transformer
    <span style="color: #d3869b;">st</span>/string-transformer
    <span style="color: #d3869b;">st</span>/strip-extra-keys-transformer
    <span style="color: #d3869b;">st</span>/strip-extra-values-transformer<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgad4aabf" class="outline-4">
<h4 id="orgad4aabf"><span class="section-number-4">4.6.2</span> sanitize-params - returns nil if spec not passed</h4>
<div class="outline-text-4" id="text-4-6-2">
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #458588;">(</span><span style="color: #fb4933;">defn-</span> <span style="color: #fabd2f;">sanitize-params</span>
  <span style="color: #b8bb26;">"Given a params-spec and params,</span>
<span style="color: #b8bb26;">   if the params pass the spec, returns the params</span>
<span style="color: #b8bb26;">     (eliding any extra keys and values)</span>
<span style="color: #b8bb26;">   if params do not pass spec, returns nil"</span>
  <span style="color: #b16286;">[</span>event params<span style="color: #b16286;">]</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">let</span> <span style="color: #8ec07c;">[</span>coerced-params <span style="color: #d65d0e;">(</span><span style="color: #d3869b;">st</span>/coerce <span style="color: #458588;">(</span>event <span style="color: #d3869b;">:params-spec</span><span style="color: #458588;">)</span> params transformer<span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">]</span>
    <span style="color: #8ec07c;">(</span><span style="color: #fb4933;">when</span> <span style="color: #d65d0e;">(</span><span style="color: #d3869b;">s</span>/valid? <span style="color: #458588;">(</span>event <span style="color: #d3869b;">:params-spec</span><span style="color: #458588;">)</span> coerced-params<span style="color: #d65d0e;">)</span>
      coerced-params<span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2135ffe" class="outline-4">
<h4 id="org2135ffe"><span class="section-number-4">4.6.3</span> rule-errors - calls event conditions, returns true if passed</h4>
<div class="outline-text-4" id="text-4-6-3">
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #458588;">(</span><span style="color: #fb4933;">defn-</span> <span style="color: #fabd2f;">rule-errors</span>
  <span style="color: #b8bb26;">"Returns boolean of whether the the conditions for an event are satisfied.</span>
<span style="color: #b8bb26;">   Should be called with sanitized-params."</span>
  <span style="color: #b16286;">[</span>event sanitized-params<span style="color: #b16286;">]</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">-&gt;&gt;</span> <span style="color: #8ec07c;">(</span><span style="color: #d65d0e;">(</span>event <span style="color: #d3869b;">:conditions</span><span style="color: #d65d0e;">)</span> sanitized-params<span style="color: #8ec07c;">)</span>
       <span style="color: #8ec07c;">(</span>remove <span style="color: #d65d0e;">(</span><span style="color: #fb4933;">fn</span> <span style="color: #458588;">[</span><span style="color: #b16286;">[</span>pass? _ _<span style="color: #b16286;">]</span><span style="color: #458588;">]</span> pass?<span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span>
       <span style="color: #8ec07c;">(</span>map <span style="color: #d65d0e;">(</span><span style="color: #fb4933;">fn</span> <span style="color: #458588;">[</span><span style="color: #b16286;">[</span>pass? anomaly message<span style="color: #b16286;">]</span><span style="color: #458588;">]</span>
              <span style="color: #458588;">{</span><span style="color: #d3869b;">:anomaly</span> anomaly
               <span style="color: #d3869b;">:message</span> message<span style="color: #458588;">}</span><span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>
