20200525_declarative_domain_logic_tada.org
*** explain-params-errors - 
#+begin_src clojure
  (defn explain-params-errors [spec value]
    (->> (s/explain-data spec value)
         ::s/problems
         (map (fn [{:keys [path pred val via in]}]
                (match/match [pred]
                             [([fn [_] ([contains? _ missing-key] :seq)] :seq)] {:issue    :missing-key
                                                                                 :key-path (conj path missing-key)}
                             [_] {:issue    :incorrect-value
                                  :key-path path})))
         (map (fn [{:keys [issue key-path]}]
                (str key-path " " issue)))
         (string/join "\n")))

#+end_src

** do! - main dispatch function.
+ checks params are OK (if they're not, it throws)
+ checks conditions (if not, throws)
+ runs the 'effect' of an event
+ reuns the 'return' function on a map of the params (with the return from the effect added into it)

#+begin_src clojure
  (defn do! [event-id params]
    (if-let [event (@event-store event-id)]
      (if-let [sanitized-params (sanitize-params event params)]
        (let [errors (rule-errors event sanitized-params)]
          (if (empty? errors)
            (let [effect-return (when (event :effect)
                                  ((event :effect) sanitized-params))]
              (if (event :return)
                ((event :return) (assoc sanitized-params
                                        :tada/effect-return effect-return))
                nil))
            (throw (ex-info (str "Conditions for event " event-id " are not met:\n"
                                 (string/join "\n" (map :message errors)))
                            {:anomaly :incorrect}))))
        (throw (ex-info (str "Params for event " event-id " do not meet spec:\n"
                             (explain-params-errors (event :params-spec) params))
                        {:anomaly :incorrect})))
      (throw (ex-info (str "No event with id " event-id)
                      {:event-id event-id
                       :anomaly  :unsupported}))))
#+end_src

