20200525_declarative_domain_logic_tada.html

<div id="outline-container-org4555231" class="outline-4">
<h4 id="org4555231"><span class="section-number-4">4.6.4</span> explain-params-errors -</h4>
<div class="outline-text-4" id="text-4-6-4">
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #458588;">(</span><span style="color: #fb4933;">defn</span> <span style="color: #fabd2f;">explain-params-errors</span> <span style="color: #b16286;">[</span>spec value<span style="color: #b16286;">]</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">-&gt;&gt;</span> <span style="color: #8ec07c;">(</span><span style="color: #d3869b;">s</span>/explain-data spec value<span style="color: #8ec07c;">)</span>
       <span style="color: #d3869b;">::</span><span style="color: #d3869b;">s</span><span style="color: #fdf4c1; background-color: #282828;">/</span><span style="color: #d3869b;">problems</span>
       <span style="color: #8ec07c;">(</span>map <span style="color: #d65d0e;">(</span><span style="color: #fb4933;">fn</span> <span style="color: #458588;">[</span><span style="color: #b16286;">{</span><span style="color: #d3869b;">:keys</span> <span style="color: #8ec07c;">[</span>path pred val via in<span style="color: #8ec07c;">]</span><span style="color: #b16286;">}</span><span style="color: #458588;">]</span>
              <span style="color: #458588;">(</span><span style="color: #d3869b;">match</span>/match <span style="color: #b16286;">[</span>pred<span style="color: #b16286;">]</span>
                           <span style="color: #b16286;">[</span><span style="color: #8ec07c;">(</span><span style="color: #d65d0e;">[</span>fn <span style="color: #458588;">[</span>_<span style="color: #458588;">]</span> <span style="color: #458588;">(</span><span style="color: #458588;">[</span>contains? _ missing-key<span style="color: #458588;">]</span> <span style="color: #d3869b;">:seq</span><span style="color: #458588;">)</span><span style="color: #d65d0e;">]</span> <span style="color: #d3869b;">:seq</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">]</span> <span style="color: #b16286;">{</span><span style="color: #d3869b;">:issue</span>    <span style="color: #d3869b;">:missing-key</span>
                                                                               <span style="color: #d3869b;">:key-path</span> <span style="color: #8ec07c;">(</span>conj path missing-key<span style="color: #8ec07c;">)</span><span style="color: #b16286;">}</span>
                           <span style="color: #b16286;">[</span>_<span style="color: #b16286;">]</span> <span style="color: #b16286;">{</span><span style="color: #d3869b;">:issue</span>    <span style="color: #d3869b;">:incorrect-value</span>
                                <span style="color: #d3869b;">:key-path</span> path<span style="color: #b16286;">}</span><span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span>
       <span style="color: #8ec07c;">(</span>map <span style="color: #d65d0e;">(</span><span style="color: #fb4933;">fn</span> <span style="color: #458588;">[</span><span style="color: #b16286;">{</span><span style="color: #d3869b;">:keys</span> <span style="color: #8ec07c;">[</span>issue key-path<span style="color: #8ec07c;">]</span><span style="color: #b16286;">}</span><span style="color: #458588;">]</span>
              <span style="color: #458588;">(</span>str key-path <span style="color: #b8bb26;">" "</span> issue<span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span>
       <span style="color: #8ec07c;">(</span><span style="color: #d3869b;">string</span>/join <span style="color: #b8bb26;">"</span><span style="color: #b8bb26; font-weight: bold;">\n</span><span style="color: #b8bb26;">"</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb1105ce" class="outline-3">
<h3 id="orgb1105ce"><span class="section-number-3">4.7</span> do! - main dispatch function.</h3>
<div class="outline-text-3" id="text-4-7">
<ul class="org-ul">
<li>checks params are OK (if they're not, it throws)</li>
<li>checks conditions (if not, throws)</li>
<li>runs the 'effect' of an event</li>
<li>reuns the 'return' function on a map of the params (with the return from the effect added into it)</li>
</ul>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #458588;">(</span><span style="color: #fb4933;">defn</span> <span style="color: #fabd2f;">do!</span> <span style="color: #b16286;">[</span>event-id params<span style="color: #b16286;">]</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">if-let</span> <span style="color: #8ec07c;">[</span>event <span style="color: #d65d0e;">(</span>@event-store event-id<span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">]</span>
    <span style="color: #8ec07c;">(</span><span style="color: #fb4933;">if-let</span> <span style="color: #d65d0e;">[</span>sanitized-params <span style="color: #458588;">(</span>sanitize-params event params<span style="color: #458588;">)</span><span style="color: #d65d0e;">]</span>
      <span style="color: #d65d0e;">(</span><span style="color: #fb4933;">let</span> <span style="color: #458588;">[</span>errors <span style="color: #b16286;">(</span>rule-errors event sanitized-params<span style="color: #b16286;">)</span><span style="color: #458588;">]</span>
        <span style="color: #458588;">(</span><span style="color: #fb4933;">if</span> <span style="color: #b16286;">(</span>empty? errors<span style="color: #b16286;">)</span>
          <span style="color: #b16286;">(</span><span style="color: #fb4933;">let</span> <span style="color: #8ec07c;">[</span>effect-return <span style="color: #d65d0e;">(</span><span style="color: #fb4933;">when</span> <span style="color: #458588;">(</span>event <span style="color: #d3869b;">:effect</span><span style="color: #458588;">)</span>
                                <span style="color: #458588;">(</span><span style="color: #458588;">(</span>event <span style="color: #d3869b;">:effect</span><span style="color: #458588;">)</span> sanitized-params<span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">]</span>
            <span style="color: #8ec07c;">(</span><span style="color: #fb4933;">if</span> <span style="color: #d65d0e;">(</span>event <span style="color: #d3869b;">:return</span><span style="color: #d65d0e;">)</span>
              <span style="color: #d65d0e;">(</span><span style="color: #458588;">(</span>event <span style="color: #d3869b;">:return</span><span style="color: #458588;">)</span> <span style="color: #458588;">(</span>assoc sanitized-params
                                      <span style="color: #d3869b;">:</span><span style="color: #d3869b;">tada</span><span style="color: #fdf4c1; background-color: #282828;">/</span><span style="color: #d3869b;">effect-return</span> effect-return<span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span>
              <span style="color: #d3869b;">nil</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
          <span style="color: #b16286;">(</span><span style="color: #fb4933;">throw</span> <span style="color: #8ec07c;">(</span>ex-info <span style="color: #d65d0e;">(</span>str <span style="color: #b8bb26;">"Conditions for event "</span> event-id <span style="color: #b8bb26;">" are not met:</span><span style="color: #b8bb26; font-weight: bold;">\n</span><span style="color: #b8bb26;">"</span>
                               <span style="color: #458588;">(</span><span style="color: #d3869b;">string</span>/join <span style="color: #b8bb26;">"</span><span style="color: #b8bb26; font-weight: bold;">\n</span><span style="color: #b8bb26;">"</span> <span style="color: #458588;">(</span>map <span style="color: #d3869b;">:message</span> errors<span style="color: #458588;">)</span><span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span>
                          <span style="color: #d65d0e;">{</span><span style="color: #d3869b;">:anomaly</span> <span style="color: #d3869b;">:incorrect</span><span style="color: #d65d0e;">}</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span>
      <span style="color: #d65d0e;">(</span><span style="color: #fb4933;">throw</span> <span style="color: #458588;">(</span>ex-info <span style="color: #b16286;">(</span>str <span style="color: #b8bb26;">"Params for event "</span> event-id <span style="color: #b8bb26;">" do not meet spec:</span><span style="color: #b8bb26; font-weight: bold;">\n</span><span style="color: #b8bb26;">"</span>
                           <span style="color: #8ec07c;">(</span>explain-params-errors <span style="color: #d65d0e;">(</span>event <span style="color: #d3869b;">:params-spec</span><span style="color: #d65d0e;">)</span> params<span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
                      <span style="color: #b16286;">{</span><span style="color: #d3869b;">:anomaly</span> <span style="color: #d3869b;">:incorrect</span><span style="color: #b16286;">}</span><span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span>
    <span style="color: #8ec07c;">(</span><span style="color: #fb4933;">throw</span> <span style="color: #d65d0e;">(</span>ex-info <span style="color: #458588;">(</span>str <span style="color: #b8bb26;">"No event with id "</span> event-id<span style="color: #458588;">)</span>
                    <span style="color: #458588;">{</span><span style="color: #d3869b;">:event-id</span> event-id
                     <span style="color: #d3869b;">:anomaly</span>  <span style="color: #d3869b;">:unsupported</span><span style="color: #458588;">}</span><span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Joe</p>
<p class="date">Created: 2020-05-25 Mon 14:04</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
